posts/potoki/index.html
<!DOCTYPE html>
<html prefix="
        og: http://ogp.me/ns# article: http://ogp.me/ns/article#
    " vocab="http://ogp.me/ns" lang="ru">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>SICP Потоки | VelikiiNehochuha Blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="ru" href="../../rss.xml">
<link rel="canonical" href="http://velikiinehochuha.github.io/posts/potoki/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Velikii Nehochuha">
<link rel="prev" href="../sicp-34-parallelizm-vremia-imeet-znachenie/" title="SICP 3.4 Параллелизм: время имеет значение" type="text/html">
<link rel="next" href="../dinamicheskoe-programmirovanie/" title="Лекция 10-11, Динамическое программирование" type="text/html">
<meta property="og:site_name" content="VelikiiNehochuha Blog">
<meta property="og:title" content="SICP Потоки">
<meta property="og:url" content="http://velikiinehochuha.github.io/posts/potoki/">
<meta property="og:description" content="Упражнение 3.50


Закончите следующее определение, которое обращает процедуру stream-map, чтобы она позволяла использовать процедуры от нескольких аргументов, подобно map из раздела 2.2.1


(define (s">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-06-12T19:17:51+03:00">
<meta property="article:tag" content="sicp">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Перейти к главному содержимому</a>
    <div id="container">
            <header id="header"><h1 id="brand"><a href="http://velikiinehochuha.github.io/" title="VelikiiNehochuha Blog" rel="home">

        <span id="blog-title">VelikiiNehochuha Blog</span>
    </a></h1>

        
            <nav id="menu"><ul>
<li><a href="../../archive.html">Архив</a></li>
                <li><a href="../../categories/">Тэги</a></li>
                <li><a href="../../rss.xml">RSS лента</a></li>

    
    
    
    </ul></nav></header><main id="content"><article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">SICP Потоки</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    Velikii Nehochuha
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2020-06-12T19:17:51+03:00" itemprop="datePublished" title="2020-06-12 19:17">2020-06-12 19:17</time></a>
            </p>
                    <p class="sourceline"><a href="index.org" class="sourcelink">Источник</a></p>

        </div>
        
    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org39c0b2d" class="outline-2">
<h2 id="org39c0b2d">Упражнение 3.50</h2>
<div class="outline-text-2" id="text-org39c0b2d">
<p>
Закончите следующее определение, которое обращает процедуру stream-map, чтобы она позволяла использовать процедуры от нескольких аргументов, подобно map из раздела 2.2.1
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">stream-map</span> <span class="nv">proc</span> <span class="o">.</span> <span class="nv">argstreams</span><span class="p">)</span>
  <span class="p">(</span><span class="k">if </span><span class="p">(</span><span class="nf">stream-null?</span> <span class="p">(</span><span class="nb">car </span><span class="nv">argstreams</span><span class="p">))</span>
      <span class="nv">the-empty-stream</span>
      <span class="p">(</span><span class="nf">cons-stream</span>
       <span class="p">(</span><span class="nb">apply </span><span class="nv">proc</span> <span class="p">(</span><span class="nb">map </span><span class="nv">stream-car</span> <span class="nv">argstreams</span><span class="p">))</span>
       <span class="p">(</span><span class="nb">apply </span><span class="nv">stream-map</span>
	      <span class="p">(</span><span class="nb">cons </span><span class="nv">proc</span> <span class="p">(</span><span class="nb">map </span><span class="nv">stream-cdr</span> <span class="nv">argstreams</span><span class="p">))))))</span>
</pre></div>
</div>
</div>

<div id="outline-container-orgd4d14d3" class="outline-2">
<h2 id="orgd4d14d3">Упражнение 3.51</h2>
<div class="outline-text-2" id="text-orgd4d14d3">
<p>
Чтобы внимательнее изучить задержанные вычисления, мы воспользуемся следующей процедурой, которая печатает свой аргумент, а затем возвращает его:
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">show</span> <span class="nv">x</span><span class="p">)</span>
  <span class="p">(</span><span class="nf">display-line</span> <span class="nv">x</span><span class="p">)</span>
  <span class="nv">x</span><span class="p">)</span>
</pre></div>

<p>
Что печатает интерпретатор в ответ на каждое выражение из следующей последовательности?
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="nv">x</span> <span class="p">(</span><span class="nf">stream-map</span> <span class="nv">show</span> <span class="p">(</span><span class="nf">stream-enumerate-interval</span> <span class="mi">0</span> <span class="mi">10</span><span class="p">)))</span>
<span class="c1">;; 0</span>
<span class="c1">;; 2</span>
<span class="c1">;; ...</span>
<span class="c1">;; 10</span>
<span class="p">(</span><span class="nf">stream-ref</span> <span class="nv">x</span> <span class="mi">5</span><span class="p">)</span>
<span class="c1">;; 5</span>
<span class="p">(</span><span class="nf">stream-ref</span> <span class="nv">x</span> <span class="mi">7</span><span class="p">)</span>
<span class="c1">;; 7</span>
</pre></div>
</div>
</div>

<div id="outline-container-org86ba445" class="outline-2">
<h2 id="org86ba445">Упражнение 3.52</h2>
<div class="outline-text-2" id="text-org86ba445">
<p>
Рассмотрим последовательность выражений
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="nv">sum</span> <span class="mi">0</span><span class="p">)</span>

<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">accum</span> <span class="nv">x</span><span class="p">)</span>
  <span class="p">(</span><span class="k">set! </span><span class="nv">sum</span> <span class="p">(</span><span class="nb">+ </span><span class="nv">x</span> <span class="nv">sum</span><span class="p">))</span>
  <span class="nv">sum</span><span class="p">)</span>

<span class="p">(</span><span class="k">define </span><span class="nv">seq</span> <span class="p">(</span><span class="nf">stream-map</span> <span class="nv">accum</span> <span class="p">(</span><span class="nf">stream-enumerate-interval</span> <span class="mi">1</span> <span class="mi">20</span><span class="p">)))</span>
<span class="nv">seq</span>
<span class="p">(</span><span class="k">define </span><span class="nv">y</span> <span class="p">(</span><span class="nf">stream-filter</span> <span class="nv">even?</span> <span class="nv">seq</span><span class="p">))</span>
<span class="nv">y</span>
<span class="p">(</span><span class="k">define </span><span class="nv">z</span> <span class="p">(</span><span class="nf">stream-filter</span> <span class="p">(</span><span class="k">lambda </span><span class="p">(</span><span class="nf">x</span><span class="p">)</span> <span class="p">(</span><span class="nb">= </span><span class="p">(</span><span class="nb">remainder </span><span class="nv">x</span> <span class="mi">5</span><span class="p">)</span> <span class="mi">0</span><span class="p">))</span>
			 <span class="nv">seq</span><span class="p">))</span>
<span class="nv">z</span>
<span class="p">(</span><span class="nf">stream-ref</span> <span class="nv">y</span> <span class="mi">7</span><span class="p">)</span>
<span class="p">(</span><span class="nf">display-stream</span> <span class="nv">z</span><span class="p">)</span>
</pre></div>

<p>
Изменился бы этот результат, если бы мы реализовали (delay выражение) просто как (lambda () выражение), не применяя оптимизацию через memo-proc? Объясните свой ответ.
</p>

<p>
Ответ бы не изменился, но при вызове display-stream элементы последовательности вычислялись бы повторно, что сказывается на производительности.
</p>
</div>
</div>

<div id="outline-container-org69f5df4" class="outline-2">
<h2 id="org69f5df4">Упражнение 3.53</h2>
<div class="outline-text-2" id="text-org69f5df4">
<p>
Не запуская программу, опишите элементы потока, порождаемого
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">add-streams</span> <span class="nv">s1</span> <span class="nv">s2</span><span class="p">)</span>
  <span class="p">(</span><span class="nf">stream-map</span> <span class="nv">+</span> <span class="nv">s1</span> <span class="nv">s2</span><span class="p">))</span>
<span class="p">(</span><span class="k">define </span><span class="nv">s</span> <span class="p">(</span><span class="nf">cons-stream</span> <span class="mi">1</span> <span class="p">(</span><span class="nf">add-streams</span> <span class="nv">s</span> <span class="nv">s</span><span class="p">)))</span>
</pre></div>

<p>
1 2 4 8 16, …
</p>
</div>
</div>


<div id="outline-container-orgb037f6a" class="outline-2">
<h2 id="orgb037f6a">Упражнение 3.54</h2>
<div class="outline-text-2" id="text-orgb037f6a">
<p>
Определите процедуру mul-streams, аналогичную add-streams, которая порождает поэлементное произведение двух входных потоков. С помощью нее и потока integers закончите следующее определение потока, n-й элемент которого (начиная с 0) равен факториалу n + 1:
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">mul-streams</span> <span class="nv">s1</span> <span class="nv">s2</span><span class="p">)</span>
  <span class="p">(</span><span class="nf">stream-map</span> <span class="nv">*</span> <span class="nv">s1</span> <span class="nv">s2</span><span class="p">))</span>
<span class="p">(</span><span class="k">define </span><span class="nv">factorials</span> <span class="p">(</span><span class="nf">cons-stream</span> <span class="mi">1</span> <span class="p">(</span><span class="nf">mul-streams</span> <span class="nv">integers</span> <span class="nv">factorials</span><span class="p">)))</span>
</pre></div>
</div>
</div>

<div id="outline-container-org3eb2a04" class="outline-2">
<h2 id="org3eb2a04">Упражнение 3.55.</h2>
<div class="outline-text-2" id="text-org3eb2a04">
<p>
Определите процедуру partial-sums, которая в качестве аргумента берет поток S, а возвращает поток, элементы которого равны S0, S0 + S1, S0 + S1 + S2, . . .. Например, (partial-sums integers) должно давать поток 1, 3, 6, 10, 15
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">stream</span><span class="p">)</span>
  <span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">iter</span> <span class="nv">ps</span> <span class="nv">prev</span><span class="p">)</span>
    <span class="p">(</span><span class="nf">cons-stream</span> <span class="p">(</span><span class="nb">+ </span><span class="p">(</span><span class="nf">stream-car</span> <span class="nv">ps</span><span class="p">)</span> <span class="nv">prev</span><span class="p">)</span> <span class="p">(</span><span class="nf">iter</span> <span class="p">(</span><span class="nf">stream-cdr</span> <span class="nv">ps</span><span class="p">)</span> <span class="p">(</span><span class="nb">+ </span><span class="p">(</span><span class="nf">stream-car</span> <span class="nv">ps</span><span class="p">)</span> <span class="nv">prev</span><span class="p">))))</span>
  <span class="p">(</span><span class="nf">iter</span> <span class="nv">stream</span> <span class="mi">0</span><span class="p">))</span>

<span class="p">(</span><span class="nf">stream-ref</span> <span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">integers</span><span class="p">)</span> <span class="mi">0</span><span class="p">)</span> <span class="c1">;; 1</span>
<span class="p">(</span><span class="nf">stream-ref</span> <span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">integers</span><span class="p">)</span> <span class="mi">1</span><span class="p">)</span> <span class="c1">;; 3</span>
<span class="p">(</span><span class="nf">stream-ref</span> <span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">integers</span><span class="p">)</span> <span class="mi">2</span><span class="p">)</span> <span class="c1">;; 6</span>
<span class="p">(</span><span class="nf">stream-ref</span> <span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">integers</span><span class="p">)</span> <span class="mi">3</span><span class="p">)</span> <span class="c1">;; 10</span>
<span class="p">(</span><span class="nf">stream-ref</span> <span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">integers</span><span class="p">)</span> <span class="mi">4</span><span class="p">)</span> <span class="c1">;; 15</span>

<span class="c1">;; more nicely solution</span>
<span class="p">(</span><span class="k">define </span><span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">s</span><span class="p">)</span>
   <span class="p">(</span><span class="nf">add-streams</span> <span class="nv">s</span> <span class="p">(</span><span class="nf">cons-stream</span> <span class="mi">0</span> <span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">s</span><span class="p">))))</span>

<span class="p">(</span><span class="nf">stream-ref</span> <span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">integers</span><span class="p">)</span> <span class="mi">0</span><span class="p">)</span> <span class="c1">;; 1</span>
<span class="p">(</span><span class="nf">stream-ref</span> <span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">integers</span><span class="p">)</span> <span class="mi">1</span><span class="p">)</span> <span class="c1">;; 3</span>
<span class="p">(</span><span class="nf">stream-ref</span> <span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">integers</span><span class="p">)</span> <span class="mi">2</span><span class="p">)</span> <span class="c1">;; 6</span>
<span class="p">(</span><span class="nf">stream-ref</span> <span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">integers</span><span class="p">)</span> <span class="mi">3</span><span class="p">)</span> <span class="c1">;; 10</span>
<span class="p">(</span><span class="nf">stream-ref</span> <span class="p">(</span><span class="nf">partial-sums</span> <span class="nv">integers</span><span class="p">)</span> <span class="mi">4</span><span class="p">)</span> <span class="c1">;; 15</span>
</pre></div>
</div>
</div>

<div id="outline-container-org6959d5e" class="outline-2">
<h2 id="org6959d5e">Упражнения 3.56.</h2>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/sicp/" rel="tag">sicp</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../sicp-34-parallelizm-vremia-imeet-znachenie/" rel="prev" title="SICP 3.4 Параллелизм: время имеет значение">Предыдущая запись</a>
            </li>
            <li class="next">
                <a href="../dinamicheskoe-programmirovanie/" rel="next" title="Лекция 10-11, Динамическое программирование">Следующая запись</a>
            </li>
        </ul></nav></aside></article></main><footer id="footer"><p>Contents © 2020         <a href="mailto:anton.s.pilipenko@gmail.com">Velikii Nehochuha</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
                <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element) {
            return element.getElementsByTagName('img')[0].alt;
    }});
    </script>
</body>
</html>
